//package homeWork1;
//
//public class Pobitov1_3 {
//1.3 В отдельном классе попробуйте сделать побитовую операцию с литералом 42.5, опишите результат в комментариях в классе с заданием.
//    public static void main(String[] args) {
//        float a = 42.5f;// побитовые операции только с целочисленными типами, потому что числа с плавающей точкой хранятся в другом формате
//        // взаимосвязь между которыми нарушит побитовая операция.
//        int b = 8;
//        int z = a | b;
//        System.out.println(z);//Java: bad operand types for binary operator '|'
//    }
//}
